/*

	1. C언어에 대한 소개
		1) C언어의 역사
			켄 톰프슨과 데니스 리치가 'AT&T 벨 연구소'에서
			일할 당시 새로 개발된 유닉스 운영체제에서 사용하기 위해 만든 언어.

			기존 프로그래밍 언어인 BCPL 언어를 켄 톰프슨이 필요에 맞추어 개조해
			B언어를 만들었고, 이를 데니스 리치가 개선하여 C언어 탄생.


		2) C언어와 컴파일러
			프로그래밍 언어는 컴퓨터와 사람이 의사소통 할 수 있게 해주는 수단.
			컴퓨터는 사용자가 작성한 코드를 이해할 수 없음.
			이러한 명령어를 처리하기 위해 사용자의 명령이
			컴퓨터가 이해할 수 있는 기계어 형태로 전달되어야 하는데,
			C 언어로 작성된 명령을 기계어로 번역해 전달하는 것이 컴파일러의 역할.


		3) C 언어의 특징
			(1) C 언어는 절차지향 언어
				절차지향이란 정해진 순서에 따라 실행된다는 의미.
				C 언어로 작성한 프로그램은 순서를 중심으로 실행.

			(2) C 언어는 이식성이 좋음
				명령을 수행하는 기계의 CPU 종류에 구애받지 않고 실행 가능.
				운영체제가 달라져도 프로그램은 큰 영향을 받지 않음.

			(3) C 언어는 저급 언어
				컴퓨터 입장에서 C 언어는 다른 언어에 비해 이해하기 수월한 언어에 속함.
				수준이 낮다는 게 아니라 컴퓨터에 조금 더 친화적 언어라는 의미.
				반대로 고급 언어는 사용자 친화적 언어.


*/