package stringTest;

public class StringTask {
	public static void main(String[] args) {
		//1. 사용자에게 문자열을 입력 받아서 대문자는 소문자로, 소문자는 대문자로, 나머지는 그대로
		// 변경하여 출력하시오
		
		// 2. 사용자에게 이름, 나이, 주소를 입력 받아서
		// 콤마로 연결된 하나의 문자열로 출력하시오
		// 예시
		// 이름 >> 홍길동
		// 나이 >> 10
		// 주소 >> 서울시
		
		// 출력 : 홍길동,10,서울시
		
		// 3. 사용자에게 휴대폰 번호를 입력받아서 대시를 제거하여 출력하시오
		// 입력 >> 010-1111-1234
		// 출력 >> 01011111234
		
		// 4. 사용자에게 순위,제목,이름 을 콤마가 포함된 하나의 문자열로 입력받아서
		// 해당 순위를 1 증가하여 출력하시오
		// 입력 >> 10,괴물,홍길동
		// 출력 >> 11,괴물,홍길동
		
		// 5. 사용자에게 한글로 숫자를 입력받아서
		// 숫자로 변경하여 출력하시오
		// 입력 >> 일공이사
		// 출력 >> 1024
		
	}
}









